It is a technique used to encode categorical variables based on their relationship with the target variable. This encoding technique is useful when we have a categorical variable with a large number of unique categories, and we want to use this variable as a feature in our machine learning model.

In Target Guided Ordinal Encoding, we replace each category in the categorical variable with a numerical value based on the mean or median of the target variable for that category. This creates a monotonic relationship between the categorical variable and the target variable, which can improve the predictive power of our model.

In [1]:
import pandas as pd

# create a sample dataframe with a categorical variable and a target variable
df = pd.DataFrame({
    'city': ['New York', 'London', 'Paris', 'Tokyo', 'New York', 'Paris'],
    'price': [200, 150, 300, 250, 180, 320] #target variable
})

In [2]:
df.head()

       city  price
0  New York    200
1    London    150
2     Paris    300
3     Tokyo    250
4  New York    180

In [6]:
## calculate the mean price for each city
mean_price =  df.groupby('city')['price'].mean()
mean_price

city
London      150.0
New York    190.0
Paris       310.0
Tokyo       250.0
Name: price, dtype: float64

In [8]:
## replacing each city with mean price
df['city_encoded'] = df['city'].map(mean_price)
df

       city  price  city_encoded
0  New York    200         190.0
1    London    150         150.0
2     Paris    300         310.0
3     Tokyo    250         250.0
4  New York    180         190.0
5     Paris    320         310.0

In [9]:
import seaborn as sns
df1 = sns.load_dataset('tips')

In [11]:
## total_bill it the target
df1.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [14]:
mean_price =  df1.groupby('time')['total_bill'].median()
mean_price

time
Lunch     15.965
Dinner    18.390
Name: total_bill, dtype: float64

In [15]:
df1['time_encoder'] = df1['time'].map(mean_price)

In [18]:
df1.head()

   total_bill   tip     sex smoker  day    time  size time_encoder
0       16.99  1.01  Female     No  Sun  Dinner     2        18.39
1       10.34  1.66    Male     No  Sun  Dinner     3        18.39
2       21.01  3.50    Male     No  Sun  Dinner     3        18.39
3       23.68  3.31    Male     No  Sun  Dinner     2        18.39
4       24.59  3.61  Female     No  Sun  Dinner     4        18.39